{
    "title": "Media computer scientist",
    "company": "TU Bergakademie Freiberg",
    "reference": "Reference number: 10001-1002260666-S",
    "fullTitle": "Wissenschaftliche Mitarbeiterin/ Wissenschaftlicher Mitarbeiter und App-Entwickler (m/w/d)",
    "workingHours": "Part-time work – in the afternoon, Part-time work – in the morning, Full-time work",
    "workplace": "Freiberg, Sachsen (Saxony)",
    "type": "Salaried employment",
    "contract": "36 months",
    "onlineSince": "Dec 29, 2025",
    "description": "Wissenschaftliche Mitarbeiterin/\n\nWissenschaftlicher Mitarbeiter\n\nund App-Entwickler (m/w/d)\n\nAusschreibungskennziffer 166/2025\n\nUmfang: 1,0 VZÄ - 100 %  (40 Stunden/Woche, Teilzeit möglich)   Vergütung:  E13 TV-L \n\nBefristung: 36 Monate                                                  Beginn: zum nächstmöglichen Zeitpunkt\n\nSie werden im Team der Professur für Ubiquitous Computing & Smart Systems (Prof. Dr. Bastian Pfleging, http://ubisys.org) arbeiten. An der Schnittstelle zwischen Mensch-Computer-Interaktion und Ubiquitous Computing erforschen wir neue mensch-zentrierte Technologien und User Interfaces, um Menschen bei ihrer Arbeit und Interaktion mit Computersystemen zu unterstützen.             Zu den Anwendungsbereichen gehören u.a. HCI für sicherheitsrelevante Umgebungen, Mobilität/Automotive, Mensch-Roboter-Interaktion und Mixed Reality. Am gesamten Institut für Informatik arbeiten Forschende darüber hinaus zu Themen wie Robotik, Softwaretechnologie, Mixed Reality, Multimedia und Künstliche Intelligenz. Die Stelle ist im Rahmen eines Drittmittelprojektes zum frühestmöglichen Zeitpunkt zu besetzen. Im Rahmen der FwA-Projekte entwickeln und erforschen wir digitale Systeme und Apps zur Unterstützung von Feuerwehren im Einsatz. Ein Schwerpunkt ist eine bereits landesweit in Sachsen, Thüringen und Sachsen-Anhalt eingesetzte App, die wir nutzerzentriert weiterentwickeln.\n\n Ihr Aufgabengebiet\n\n·       eigene angeleitete Forschungs- und Entwicklungsarbeiten zu digitaler Einsatzunterstützung für Feuerwehren (mit dem Ziel Promotion oder postdoktorale Vertiefung, bei Vorliegen persönlicher Voraussetzungen und Interesse)\n\n·       Weiterentwicklung und Betrieb der Apps (iPadOS/Swift, Android/Kotlin) und ggfs. des Backends (u. a. PHP) im Team\n\n·       nutzerzentrierte Forschung/Entwicklung & Kontakt mit Auftraggebern: Anforderungen erheben, Funktionen iterativ entwickeln & erproben, Forschungserkenntnisse austauschen & vertiefen, Schulungen/Support durchführen\n\n·       Veröffentlichung von Ergebnissen auf Konferenzen und in Fachzeitschriften\n\nDas erwarten wir von Ihnen\n\n·       universitärer Diplom- oder Masterabschluss in Informatik, angewandter Informatik, Human-Computer-Interaction, Medieninformatik, Software-Engineering, Robotik oder vergleichbar\n\n·       sehr gute Programmierkenntnisse in mindestens einem der folgenden Bereiche: App-Entwicklung für 1. iPadOS (Swift) oder 2. Android (Kotlin)\n\n·       Sprachen: Deutsch mindestens C1 (Interaktion mit Projektpartnern und Nutzenden) und Englisch mind. B2\n\n·       strukturierte, qualitätsorientierte, selbstständige Arbeitsweise und Teamfähigkeit\n\n·       Bereitschaft, neue Technologien zu erlernen, erproben und anzuwenden\n\nKann\n\n·       Erfahrung mit Webservices (u.a. PHP) oder bei der Entwicklung von Multiplattform-Apps (Kotlin Multiplatform)\n\n·       HCI-Methoden (Nutzerstudien, Prototyping, Usability-Tests), Mixed Reality, IT Security\n\n·       DevOps-Grundlagen (CI/CD, Monitoring), App-Store/Deployment-Prozesse\n\nDas können Sie von uns erwarten\n\n·       familienfreundliche Arbeitsbedingungen und flexible Arbeitszeiten, hybride/mobile Arbeit\n\n·       Vergütung nach TV-L mit attraktiven Nebenleistungen (z. B. vermögenswirksame Leistungen, betriebliche Altersvorsorge VBL)\n\nIhre Bewerbung\n\nPDF-Datei (max. 10 MB) mit Motivationsschreiben (Projektbezug, Qualifizierungsziel), Lebenslauf inkl. Zeugnisse, Kurzfassung der Abschlussarbeit (<= 1 Seite) Optional: Publikationsliste/Arbeitsproben senden Sie bitte\n\nmit den üblichen Unterlagen unter Angabe der Kennziffer (166/2025)\n\nbis zum 17.12.2025 per E-Mail an: bewerbungen@tu-freiberg.de\n\noder an:   TU Bergakademie Freiberg\n\nDezernat Personalangelegenheiten\n\n09596 Freiberg\n\nFür weitere fachliche Informationen steht Ihnen\n\nHerr Prof. Dr. Bastian Pfleging\n\nTel.: 03731/39 3939\n\nE-Mail: Bastian.Pfleging@informatik.tu-freiberg.de zur Verfügung.\n\n Bewerberinnen und Bewerber (m/w/d) müssen die Einstellungsvoraussetzungen für den Abschluss von Arbeitsverträgen für eine bestimmte Zeit gemäß WissZeitVG erfüllen. Schwerbehinderte oder Gleichgestellte (m/w/d) werden bei gleicher Eignung, Leistung und Befähigung bevorzugt berücksichtigt. Bitte fügen Sie einen Nachweis bei.  Die TU Bergakademie Freiberg fördert gezielt den Anteil von Frauen und lädt qualifizierte Frauen ausdrücklich zur Bewerbung ein.\n\nOur job advertisements are always directed at all people capable of working, regardless of age, gender, origin, sexual orientation, disability, religion and ideology, etc. Applicants are exclusively selected based on their qualifications. Errors in the given information and spelling reserved.",
    "contactEmail": "bewerbungen@tu-freiberg.de",
    "contactPhone": "+49 3731 392546",
    "companyAddress": "TU Bergakademie Freiberg\n\nAkademiestr.\n09599 Freiberg, Sachsen\n\n+49 3731 392546",
    "contactEmailInformation": true
}